{
  "posts": [
    {
      "id": "1",
      "authorName": "Rehan Ali",
      "blogTitle": "Learn React",
      "blogDescription": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces based on components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies.React can be used to develop single-page, mobile, or server-rendered applications with frameworks like Next.js. Because React is only concerned with the user interface and rendering components to the DOM, React applications often rely on libraries for routing and other client-side functionality. A key advantage of React is that it only rerenders those parts of the page that have changed, avoiding unnecessary rerendering of unchanged DOM elements."
    },
    {
      "id": "2",
      "authorName": "Kunal",
      "blogTitle": "Travel the world",
      "blogDescription": "“Wandering re-establishes the original harmony which once existed between man and the universe.” –Anatole FranceTravel changes lives—for the traveller, and those they encounter. This holiday season, give a loved one or yourself the gift of a life-affirming experience to a destination we’ve featured. Whether you want to ease into a luxurious resort, live like a local in an authentic village homestay, dive with sharks, hike the Himalayas or find friendly faces around the block from home, we’ve got you covered! Find a journey to change your life, and make a difference to the people and places you visit."
    },
    {
      "id": "3",
      "authorName": "Karen",
      "blogTitle": "Music is life",
      "blogDescription": "Music is a pleasant sound which is a combination of melodies and harmony and which soothes you. Music may also refer to the art of composing such pleasant sounds with the help of the various musical instruments. A person who knows music is a Musician."
    },
    {
      "id": "4",
      "authorName": "Martin",
      "blogTitle": "Power of money",
      "blogDescription": "The basic function of money is to enable buying to be separated from selling, thus permitting trade to take place without the so-called double coincidence of barter. In principle, credit could perform this function, but, before extending credit, the seller would want to know about the prospects of repayment. That requires much more information about the buyer and imposes costs of information and verification that the use of money avoids."
    },
    {
      "id": "5",
      "authorName": "Shruti",
      "blogTitle": "All about blogging",
      "blogDescription": "A “blog” is an updated version of the old term “weblog,” used to describe websites that maintain an ongoing chronicle of information. A blog features diary-type commentary and links to articles on other websites, usually presented as a list of entries in reverse chronological order. Blogs range from personal to political and can focus on one narrow subject or a whole range of subjects.Many blogs focus on web design, home staging, sports, mobile technology, etc. Few are more eclectic, presenting links to all types of other sites. And others are more like personal journals, presenting the author’s daily life and thoughts."
    }
  ]
}